# TabbedDialogExtension Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TabbedDialogExtension Methods
TabbedDialogExtension Class See Also
---
The TabbedDialogExtension type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetContextualHelp | Gets the contextual help. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetContextualHelp | Sets the contextual help. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace